>Q1. Write a code to print the data present in the second row of the dataframe, df.

In [2]:
import pandas as pd
course_name = ['Data Science', 'Machine Learning', 'ig Data','Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [3]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2           ig Data         6
3     Data Engineer         4

In [7]:
df.iloc[1]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

>Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

* loc is used to select rows and columns by their labels (i.e., their index and column names). It takes two arguments: the first specifies the rows to select, and the second specifies the columns to select

* iloc, on the other hand, is used to select rows and columns by their integer position (i.e., their row and column numbers). It also takes two arguments: the first specifies the rows to select, and the second specifies the columns to select

>Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df
then find the output for both new_df.loc[2] and new_df.iloc[2].

In [10]:
new_df=df.reindex([3,0,1,2])

In [12]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2           ig Data         6

In [17]:
new_df.loc[2]

course_name    ig Data
duration             6
Name: 2, dtype: object

In [16]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

>>Q4. Write a code to find the following statistical measurements for the above dataframe df1:
(i) mean of each and every column present in the dataframe.
(ii) standard deviation of column, ‘column_2’

In [19]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [20]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.507040  0.089059  0.368443  0.030839  0.800268  0.397324
2  0.349908  0.628553  0.009608  0.332248  0.735043  0.560716
3  0.576722  0.355544  0.966105  0.430991  0.811023  0.939246
4  0.130746  0.590030  0.835353  0.310380  0.324997  0.929201
5  0.721885  0.226612  0.403240  0.072760  0.296927  0.707851
6  0.458970  0.359561  0.090489  0.700336  0.152987  0.628958

In [21]:
df1.mean()

column_1    0.457545
column_2    0.374893
column_3    0.445540
column_4    0.312925
column_5    0.520208
column_6    0.693883
dtype: float64

In [22]:
df1['column_2'].std()

0.20732832421163566

>>Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the
mean of column, column_2.
If you are getting errors in executing it then explain why.

In [23]:
df1.loc[2, 'column_2'] = 'string_variable'

In [ ]:
df1['column_2'].mean()

Note: If the data in the second row of column column_2 was not originally of string type, then replacing it with a string variable will result in a TypeError. In that case, you need to ensure that the data type of the replacement value matches the data type of the column.

>Q6. What do you understand about the windows function in pandas and list the types of windows
functions?

In pandas, a window function is a function that is applied to a sliding window of data in a DataFrame or Series. A sliding window is a fixed-size subset of the data that "slides" over the entire data set, one element at a time, and performs a computation on that subset.

Window functions are commonly used in time series analysis, signal processing, and other data analysis applications. They can be used to calculate rolling statistics, perform smoothing, detect anomalies, and more.

Pandas provides a number of built-in window functions that can be used with the rolling method of a DataFrame or Series. Some of the commonly used window functions in pandas are:

1) rolling : It provides rolling window calculations with a variable-sized window
2) expanding : It provides expanding window calculations over the full length of the data
3) ewm : It provides exponential weighted functions
4) rolling_apply : It applies a given function to a rolling window of values and returns the result
5) rolling_mean, rolling_max, rolling_min : These are specific window functions that calculate the mean, max and min values of a rolling window respectively
6) rolling_std, rolling_var : These are specific window functions that calculate the standard deviation and variance of a rolling window respectively

In [25]:
#examole of window 

df=pd.DataFrame({'a':[3,4,5,6,3,4,2,2]})

In [26]:
df

   a
0  3
1  4
2  5
3  6
4  3
5  4
6  2
7  2

In [27]:
df.rolling(window=2).mean()

     a
0  NaN
1  3.5
2  4.5
3  5.5
4  4.5
5  3.5
6  3.0
7  2.0

>Q7. Write a code to print only the current month and year at the time of answering this question.

In [28]:
from datetime import datetime

now = datetime.now()
current_month = now.strftime("%B")
current_year = now.year

print(f"Current month and year: {current_month} {current_year}")

Current month and year: February 2023

>Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and
calculates the difference between them in days, hours, and minutes using Pandas time delta. The
program should prompt the user to enter the dates and display the result.

In [30]:
import pandas as pd


date1 = input("Enter first date (YYYY-MM-DD): ")
date2 = input("Enter second date (YYYY-MM-DD): ")

date1 = pd.to_datetime(date1)
date2 = pd.to_datetime(date2)

delta = date2 - date1

days = delta.days
hours = delta.seconds // 3600
minutes = (delta.seconds // 60) % 60

print(f"The difference between {date1} and {date2} is {days} days, {hours} hours, and {minutes} minutes.")

Enter first date (YYYY-MM-DD):  2022-08-13
Enter second date (YYYY-MM-DD):  2023-09-12

The difference between 2022-08-13 00:00:00 and 2023-09-12 00:00:00 is 395 days, 0 hours, and 0 minutes.

> Q9. You are given a CSV file containing student data that includes the student ID and their test score. Write
a Python program that reads the CSV file, calculates the mean, median, and mode of the test scores, and
displays the results in a table.

In [39]:
import pandas as pd

df=pd.read_excel("book.xlsx")

In [40]:
df

   Student ID  Test Score
0           1          85
1           2          90
2           3          80
3           4          75
4           5          85
5           6          82
6           7          78
7           8          85
8           9          90
9          10          85

In [42]:
a=df['Test Score'].mean()

In [43]:
b=df['Test Score'].median()

In [44]:
c=df['Test Score'].mode()

In [45]:
data={'Statistic':['Mean','Mode','Median'],
      'Values':[a,b,c]}
df1=pd.DataFrame(data)

In [46]:
df1

  Statistic                                  Values
0      Mean                                    83.5
1      Mode                                    85.0
2    Median  0    85
Name: Test Score, dtype: int64